app/views/carts/pdf_invoice.html.erb

  <h1>Invoice </h1>
  <h5>To: <%= order.user.first_name %> <%= order.user.last_name %><br><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 311], ["LIMIT", 1]]

      </tr>
      <% order.cart_items.each do |cartitem| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."order_id" = $1  [["order_id", 168]]