app/views/carts/subscription_pdf.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 532], ["LIMIT", 1]]
---
  <h1>Invoice</h1>
  <h5>To: <%= subscription.user.first_name %> <%= subscription.user.last_name %><br><br>