app/controllers/carts_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 20], ["created_at", "2019-07-05 10:37:52.570463"], ["updated_at", "2019-07-05 10:37:52.570463"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 20], ["LIMIT", 1]]
INSERT INTO "cart_items" ("food_item_id", "cart_id", "created_at", "updated_at", "quantity", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["food_item_id", 26], ["cart_id", 31], ["created_at", "2019-07-05 11:32:00.382386"], ["updated_at", "2019-07-05 11:32:00.382386"], ["quantity", 7], ["status", 1]]
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def add_to_cart
    cart = current_user.cart.present? ? current_user.cart : Cart.create(user_id: current_user.id)
    @cart_item = cart.cart_items.find_or_create_by(food_item_id: params[:cart_item][:food_item_id], status:"unpaid")
    @cart_item.update(quantity: params[:cart_item][:quantity])
    @offer = Offer.find_by(id: params[:cart_item][:offer_id])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
---
  def show
    @cart = Cart.find(params[:id])