app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 137], ["LIMIT", 1]]
---
  def edit
    @cart_item = CartItem.find(params[:id])

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 143], ["LIMIT", 1]]
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
UPDATE "cart_items" SET "updated_at" = $1, "quantity" = $2 WHERE "cart_items"."id" = $3  [["updated_at", "2019-07-09 11:25:20.291808"], ["quantity", 2], ["id", 237]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(quantity: params[:cart_item][:quantity])

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 169], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 169]]
---
  def destroy
    @offer = Offer.find_by(id:params[:offer])
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy