app/controllers/charges_controller.rb

  def create
  # Amount in cents
  begin
    amount =  params[:payment][:amount]
    token = Stripe::Token.create( :card => { :number => params[:payment][:Card], :exp_month => params[:payment][:Expiry_month], :exp_year => params[:payment][:Expiry_year], :cvc =>  params[:payment][:security]})
    if !current_user.stripe_customer_id.present?
      customer = Stripe::Customer.create(:email => params[:email], :source  => token)
    end
    charge = Stripe::Charge.create(
      :amount => amount.to_i,
      :currency => "usd",
      :source => token.id, # obtained with Stripe.js
      :description => "Charge for jenny.rosen@example.com"
    )
    if charge.status.eql?('succeeded')
      order = Order.create(ammount: amount, user_id: current_user.id, status: "Paid")
      current_user.cart.cart_items.unpaid.update_all(order_id: order.id, status: "paid")
      order.create_invoice
---
INSERT INTO "orders" ("ammount", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ammount", 2200], ["status", "Paid"], ["user_id", 283], ["created_at", "2019-07-08 13:39:36.647088"], ["updated_at", "2019-07-08 13:39:36.647088"]]
UPDATE "cart_items" SET "order_id" = 168, "status" = 0 WHERE "cart_items"."cart_id" = $1 AND "cart_items"."status" = $2  [["cart_id", 196], ["status", 1]]
INSERT INTO "invoices" ("user_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 311], ["order_id", 168], ["created_at", "2019-07-09 06:45:51.187884"], ["updated_at", "2019-07-09 06:45:51.187884"]]

  def create_subscription
    plan =  Plan.find_by(id: params[:payment][:plan_id])
    begin

      if plan.present?
        stripe_plan_id = plan.stripe_plan_id
        price = plan.price
        if !current_user.stripe_customer_id
          token = Stripe::Token.create( :card => { :number => params[:payment][:Card], :exp_month => params[:payment][:Expiry_month], :exp_year => params[:payment][:Expiry_year], :cvc =>  params[:payment][:security]})
          customer = Stripe::Customer.create(:email => params[:email], :source  => token)
          current_user.update(stripe_customer_id: customer.id)
        end
        stripe_subscription = Stripe::Subscription.create(
                                                          :customer => current_user.stripe_customer_id,
                                                          :items => [{:plan => stripe_plan_id}]
                                                          )
        order = Order.create(ammount: price, status: "paid", user_id: current_user.id)
        subscription = Subscription.create(user_id: current_user.id, plan_id: plan.id, order_id: order.id, stripe_subscription_id: stripe_subscription.id, expiry_date: Time.now + plan.no_of_days.days)
        order.create_invoice
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "stripe_customer_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-07-09 13:53:25.071260"], ["stripe_customer_id", "test_cus_5"], ["id", 397]]
INSERT INTO "subscriptions" ("user_id", "plan_id", "order_id", "stripe_subscription_id", "created_at", "updated_at", "expiry_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "orders" ("ammount", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ammount", 500], ["status", "paid"], ["user_id", 532], ["created_at", "2019-07-10 10:59:15.225747"], ["updated_at", "2019-07-10 10:59:15.225747"]]
INSERT INTO "invoices" ("user_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 532], ["order_id", 368], ["created_at", "2019-07-10 10:59:15.281669"], ["updated_at", "2019-07-10 10:59:15.281669"]]