app/controllers/welcomes_controller.rb

  def menu
    @categories = Category.includes(:food_items)
---
SELECT "food_items".* FROM "food_items" WHERE "food_items"."category_id" IN ($1, $2, $3, $4, $5)  [["category_id", 195], ["category_id", 97], ["category_id", 151], ["category_id", 152], ["category_id", 153]]